{
  "hello": "welcome",
  "DEFAULT_ERRORS": {
    "SERVER_ERROR": "Request could not be completed due to server encountered error. Please try again later.",
    "NOT_FOUND": "Requested resource not found.",
    "INVALID_AUTH": "Request could not be completed due to invalid authorization",
    "MISSING_AUTH": "Please specify authorization header to access the resource",
    "MALFORMED_INPUT": "Please specify valid input",
    "VALIDATION_ERROR": "Please specify valid request parameters to continue"
  },
  "VAL_ERRORS": {
    "USR_ACC_MISSING_EMAIL": "Please specify an email address to continue",
    "USR_ACC_MISSING_PWD": "Please specify a password to continue",
    "USR_ACC_NEW_EMAIL_EXISTS": "An account is already registered with this email address. Please use a different email address to complete the registration",
    "USR_ACC_LOGIN_MISSING_EMAIL": "Please specify an email address to login",
    "USR_ACC_LOGIN_INVALID_EMAIL": "Please specify a valid email address to login",
    "USR_ACC_LOGIN_MISSING_PWD": "Please specify a password to login",
    "USR_ACC_LOGIN_INVALID_CRE": "Please specify a valid username and password to login",
    "STORE_MISSING_NAME": "Please specify a valid name to continue",
    "STORE_MISSING_PHONE": "Please specify a valid phone to continue",
    "STORE_INVALID_EMAIL": "Please specify a valid email to continue",
    "STORE_MISSING_EMAIL": "Please specify a valid email to continue",
    "STORE_MISSING_ADDRESS": "Please specify a valid address to continue",
    "STORE_MISSING_CITY": "Please specify a valid city to continue",
    "STORE_MISSING_ZIPCODE": "Please specify a valid zipcode to continue",
    "STORE_MISSING_MERCHANT_ID_EIN": "Please specify a valid merchant Id/Ein to continue",
    "STORE_MISSING_STATE": "Please specify a valid state to continue",
    "STORE_MISSING_STORE_IDENTIFIER": "Please specify a valid store identifier to continue",
    "INVALID_AMOUNT": "Please specify a valid amount greater than 0 to continue",
    "MISSING_CONSUMER_WALLET_ADDRESS": "Please specify a valid consumer wallet address to continue",
    "MISSING_MERCHANT_WALLET_ADDRESS": "Please specify a valid merchant wallet address to continue",
    "STORE_ID_EXISTS": "A store is already registered with this store id. Please use a different store id to complete the registration",
    "STORE_ALREADY_ASSIGNED": "This store is already assigned to this employee. Please select a different store to continue",
    "EMP_ACC_LOGIN_INVALID_STORE_IDENTIFIER": "Please specify a valid store id to login",
    "EMP_ACC_LOGIN_INVALID_CRE": "Plese specify a valid employee number and password to login",
    "EMP_ACC_LOGIN_ACCESS_DENIED": "Please ask your store owner to provide access to the store",
    "EMP_ACC_LOGIN_MISSING_EMP_NUMBER": "Please specify an employee number to login",
    "EMP_ACC_LOGIN_MISSING_STORE_IDENTIFIER": "Please specify a store id to continue",
    "EMP_ACC_LOGIN_MISSING_PIN": "Please specify a pin to continue",
    "INVALID_QUANTITY": "Please specify a valid quantiy greater than 0 to continue",
    "INVALID_PRODUCT_ID": "Request could not be resolved as provided product ID is invalid",
    "MISSING_TAX_RATE": "Please specify a store tax rate to continue",
    "INVALID_TAX_RATE": "Please specify a valid store tax rate to continue",
    "INVALID_PAYMENT_MODE": "Please specify a valid mode of payment for transaction to continue",
    "MISSING_PAYMENT_ID": "Please specify a valid Payment Id to continue for which kadima topup is to be done"
  },
  "PAYMENT": {
    "TRANSACTION_PAID": "The transaction has been paid. Please make sure you are paying for the correct transaction",
    "INSUFFICIENT_BALANCE": "You have insufficient balance to pay the transaction. Please make sure you have enough balance in your wallet to continue",
    "INSUFFICIENT_BALANCE_TO_EXECUTE_TRANSACTION": "You have insufficient balance to execute the transaction. Please transfer at least %s ETH to your wallet %s to continue.",
    "INSUFFICIENT_ETH_IN_SYSTEM_WALLET": "The system wallet does not have enough ether to process the request",
    "INSUFFICIENT_KADIMA_IN_CONSUMER_WALLET": "The consumer wallet does not have enough kadima to process the request, Please request him to transfer at least %s Kadima to his wallet %s to continue.",
    "INSUFFICIENT_KADIMA_IN_SYSTEM_WALLET": "The system wallet does not have enough kadima to process the request",
    "TRANSACTION_IN_PROCESS": "The payment for the transaction is already in progress",
    "TRANSACTION_NOT_PAID": "The transaction has not been paid. Please make sure the transaction is paid to send email invoice"
  },
  "PRODUCT": {
    "NOT_ACTIVE": "Please select a valid active product to continue"
  },
  "REQ_ERRORS": {
    "INVALID_ID": "Request could not be resolved as provided ID is invalid"
  }
}
